Revit 2027 API
RebarShapeDefinitionByArc.AddConstraintDiameter Method
 Specify a parameter to drive the diameter of the shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddConstraintDiameter(
	ElementId paramId,
	RebarShapeArcReferenceType arcRefType
)
Public Sub AddConstraintDiameter (
	paramId As ElementId,
	arcRefType As RebarShapeArcReferenceType
)
public:
void AddConstraintDiameter(
	ElementId^ paramId,
	RebarShapeArcReferenceType arcRefType
)
member AddConstraintDiameter :
        paramId : ElementId *
        arcRefType : RebarShapeArcReferenceType -> unit
Parameters
paramId ElementId
 Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().
arcRefType RebarShapeArcReferenceType
 Specify how the diameter should be measured--to the interior of the bend, the centerline of the bar, or the exterior.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace